package com.fishingpoints.data.local.database.initializer.catalog


import com.fishingpoints.data.local.database.dao.FeedDao
import com.fishingpoints.data.local.entity.Feed
import com.fishingpoints.data.local.enums.Season
import javax.inject.Inject

internal object FeedData {
    val all: List<Feed> = listOf(
        Feed(
            name = "Кормовая смесь",
            bestSeason = Season.SUMMER,
            bestForFish = "Карась, карп, лещ, плотва.",
            description = "На одну рыбалку:\n" +
                    "    500 г готовой фидерной прикормки — лучше универсальной или карповой;\n" +
                    "    200 г панировочных сухарей;\n" +
                    "    100–150 г молотой кукурузной крупы;\n" +
                    "    100 г варёного гороха или консервированной кукурузы;\n" +
                    "    50–100 г мелкого опарыша — если используете животную добавку;\n" +
                    "    немного воды из водоёма для увлажнения.\n" +
                    "Для леща: сделайте смесь более мелкой и чуть более сладкой.\n" +
                    "Для карася: добавьте кукурузу, немного чеснока или кориандра.\n" +
                    "Для карпа: больше кукурузы, гороха и крупных частиц "
        ),

        Feed(
            name = "Прикормка на карася в сентябре",
            bestSeason = Season.AUTUMN,
            bestForFish = "Для карася, карпа, леща и плотвы. ",
            description = " Основа: варёное пшено (до рассыпчатого состояния, чтобы зёрна были целыми, но мягкими). " +
                    "Можно использовать и другие крупы (перловку, кукурузную). \n" +
                    "Дополнительные компоненты:\n" +
                    "Панировочные сухари — создают мутное облако, привлекающее рыбу.\n" +
                    "Молотые жареные семечки или макуха — их маслянистый запах карась чувствует издалека.\n" +
                    "Животный компонент — обязательный элемент в холодной воде: горсть мелкого кормового мотыля, рубленого червя или давленого опарыша.\n" +
                    "Отруби — добавляют объём и медленно распадаются в воде, поднимая частички со дна.\n" +
                    "Ароматизаторы: в сентябре лучше работают пряные и специи (кориандр, укроп, анис, чеснок). " +
                    "Сладкие ароматы (ваниль, клубника) могут отпугнуть рыбу. Добавляйте ароматизатор умеренно: на килограмм смеси достаточно половины чайной ложки. \n" +
                    "Цвет: в прозрачной осенней воде светлая прикормка на тёмном фоне дна может насторожить карася. Поэтому смесь лучше затемнить: " +
                    "добавьте тёмную глину, землю с берега или пищевой краситель.0  "
        )
    )
}

internal class FeedSeeder @Inject constructor(
    private val feedDao: FeedDao
) {
    suspend fun seedIfEmpty() {
        if (feedDao.getFeedCount() != 0) return
        FeedData.all.forEach { feedDao.insertFeed(it) }
    }
}