package com.fishingpoints.data.local.database.initializer.catalog

import com.fishingpoints.data.local.database.dao.FishDao
import com.fishingpoints.data.local.entity.Fish
import com.fishingpoints.data.local.enums.FeedingActivity
import javax.inject.Inject

internal class FishSeeder @Inject constructor(
    private val fishDao: FishDao
) {
    suspend fun seedIfEmpty() {
        if (fishDao.getFishCount() != 0) return
        FishData.all.forEach { fishDao.insertFish(it) }
    }
}


internal object FishData {
    val all: List<Fish> = listOf(

        Fish(
            name = "Щука",
            imageUrl = "pike",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 4,
            temperatureMax = 20,
            pressureMin = 740,
            pressureMax = 770,
            description = "Хищная рыба семейства щуковых. Обитает в пресных водоемах с чистой водой." +
                    "У щуки очень узнаваемый силуэт:\n" +
                    "Вытянутое, стреловидное тело — идеально для резких ускорений.\n" +
                    "Большая голова с сильно выдающейся вперёд нижней челюстью и множеством острых зубов: крупные клыки спереди и мелкие «щёточки» внутри, направленные в глотку — они не дают добыче выскользнуть.\n" +
                    "Пятнистый камуфляж: спина тёмно‑зелёная или буроватая, бока с крупными тёмными пятнами, образующими поперечные полосы; брюхо светлое. Окраска подстраивается под среду: в заросших водоёмах щука темнее, в светлых — серебристее.\n" +
                    "Плавники: непарные — с тёмными пятнышками, парные — оранжево‑жёлтые.\n" +
                    "Размеры: обычно 50–80см и 2–6кг, но трофейные экземпляры бывают свыше 1м и 10–15кг (а в отдельных случаях — до 1,5м и более 30кг). Живёт до 20–25лет.",
            tipsBaits = "Живец (карась, плотва), крупные блесны-колебалки, силиконовые приманки, воблеры.",
            tackles = "Спиннинг. Самый популярный вариант. Удилище 2,1–2,7м, тест 10–30 или 15–40г " +
                    "(под вес приманок и условия), строй средне‑быстрый или быстрый. Катушка 2500–4000, " +
                    "плетёнка 0,10–0,16мм. Обязательно использовать металлический поводок (струна или " +
                    "титановый/стальной поводок) — иначе щука перерезает леску зубами.\n" +
                    "Троллинг. Для больших водоёмов и поиска активной рыбы. Воблеры с нужным заглублением, поводки обязательны.\n" +
                    "Живцовая снасть. Кружки, жерлицы, поплавочная удочка с живцом. Эффективно и летом, и зимой (жерлицы). Живец — узкотелая рыба 7–12см (уклейка, пескарь, мелкая плотва).\n" +
                    "Зимняя ловля. Жерлицы и отвесное блеснение (балансиры, вертикальные блёсны, раттлины)",
            baitForFish = "Воблеры минноу 90–130мм — для активной проводки и поиска рыбы.\n" +
                    "Блесны (колеблющиеся и вращающиеся) — классика, особенно на границе травы и чистой воды.\n" +
                    "Силиконовые приманки на офсетном крючке (незацепляйки) — удобны в траве.\n" +
                    "Твичинговая проводка (рывковая) для воблеров и некоторых силиконовых приманок даёт отличные результаты.\n" +
                    "Балансиры и раттлины 7–9см — для зимы.",
            adviceFromFishermen = "Ищите укрытия. Щука стоит там, где можно устроить засаду: край травы, коряга, свал, граница струй.\n" +
                    "Проводите приманку рядом с укрытием. Часто поклёвка случается на паузе или при смене темпа проводки.\n" +
                    "Меняйте типы приманок. Если щука неактивна, попробуйте сменить воблер на блесну или силикон.\n" +
                    "Ловите на зорях. Утром и вечером шансы выше, но в пасмурные дни щука может брать весь день.\n" +
                    "Не торопитесь с подсечкой. Удар щуки часто резкий, но иногда она сначала «стучит» или вяло берёт — подсекайте уверенно, но без лишней суеты."
        ),
        Fish(
            name = "Окунь",
            imageUrl = "perch",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 5,
            temperatureMax = 25,
            pressureMin = 740,
            pressureMax = 760,
            description = "У окуня тело сжато с боков и покрыто мелкой ктеноидной чешуёй (с мелкими шипиками) — " +
                    "такая же есть на щеках и жаберных крышках. За головой заметен характерный горбик. \n" +
                    "Окраска довольно яркая: спина тёмно-зелёная, бока жёлто-зелёные, а по бокам " +
                    "проходят 5–9 чёрных поперечных полос. Брюхо белое. Плавники тоже окрашены интересно: " +
                    "первый спинной — серый с чёрным пятном на конце (это один из главных отличительных признаков), " +
                    "второй — зеленовато-жёлтый. Грудные плавники жёлтые или красные, хвостовой — " +
                    "тёмный у основания и с красными участками по краям. " +
                    "Обычно взрослая особь достигает 15–25 см в длину, но самые крупные экземпляры " +
                    "вырастают до 50 см и весят более 2 кг. Живут окуни около 15 лет, хотя известны случаи, " +
                    "когда они доживали и до 25 лет.",
            tipsBaits = "Червь, мотыль, мелкие блесны, балансиры, мормышки.",
            tackles = "Легкий спиннинг (ультралайт), поплавочная удочка, зимняя удочка.",
            baitForFish = "",
            adviceFromFishermen = "Мелкие особи держатся стаями у берега, крупный ('горбач') предпочитает глубину и одиночество." +
                    "Он активен в светлое время суток, особенно рано утром, а ночью становится пассивным. " +
                    "В его меню — ручейники, подёнки, упавшие в воду насекомые, икра и мальки других рыб, водяные черви, моллюски, ракообразные, лягушки. " +
                    "Иногда окунь может есть и водоросли. Бывает, что в меню попадает и молодь собственного вида. \n" +
                    "При этом окунь очень неприхотлив: его можно встретить в самых разных водоёмах — " +
                    "в реках, озёрах, прудах. Он неплохо переносит низкое содержание кислорода в воде."
        ),

        Fish(
            name = "Ерш",
            imageUrl = "ruff",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 2,
            temperatureMax = 20,
            pressureMin = 735,
            pressureMax = 755,
            description = "Хищная рыба семейства окуневых. Длина взрослой особи – 10-20 см и масса до 200 г" +
                    " Окраска тела – защитная, варьирующаяся от светлой к темной, в характерную крапинку.",
            tipsBaits = "Мотыль, навозный червь, личинки ручейника.",
            tackles = "Поплавочная удочка. Зимняя мормышечная снасть.",
            baitForFish = "",
            adviceFromFishermen = "Требует сравнительно высокого содержания кислорода." +
                    "Клюет уверенно, часто сбивает наживку. Отличная наживка для ловли судака и щуки. " +
                    "Держится у дна."
        ),

        Fish(
            name = "Карп",
            imageUrl = "carp",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 18,
            temperatureMax = 28,
            pressureMin = 750,
            pressureMax = 760,
            description = "В процессе одомашнивания изменялись морфологические признаки. " +
                    "Появились расы высокоспинных и широкоспинных карпов; у первых высота тела рыбы " +
                    "относится к его длине, как 1:2 (до 1:2,6)," +
                    "у вторых это соотношение может доходить до 1:3. " +
                    "Кроме этого, претерпел изменения и чешуйчатый покров, наряду с чешуйчатой формой, " +
                    "близкой к дикому типу, появились голые (без чешуи) и зеркальные (с разбросанным, " +
                    "рамчатым и линейным расположением чешуи) карпы",
            tipsBaits = "Бойлы, кукуруза, пеллетс.",
            tackles = "Донные снасти, фидер, крючки №4–10",
            baitForFish = "Классическая база: жмых подсолнечника (макуха), " +
                    "вареная перловка или пшеница, молотая конопля, панировочные сухари, " +
                    "вареный горох. Ароматы — анис, укроп, конопляное семя. " +
                    "В теплой воде хорошо работают сладкие запахи: ваниль, карамель, мед. " +
                    "Обязателен животный компонент (мотыль, опарыш, рубленый червь) для удержания крупной рыбы",
            adviceFromFishermen = "Клюет лучше всего в теплой воде, любит ароматизаторы. Требуется терпение и правильная прикормка."
        ),

        Fish(
            name = "Лещ",
            imageUrl = "bream",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 10,
            temperatureMax = 22,
            pressureMin = 745,
            pressureMax = 765,
            description = "У леща очень характерный силуэт:\n" +
                    "Высокое тело, сплюснутое с боков — высота может составлять примерно треть длины рыбы.\n" +
                    "Маленький рот, способный вытягиваться в трубочку — это приспособление для кормления со дна.\n" +
                    "Высокий короткий спинной плавник и очень длинный анальный (с большим числом " +
                    "лучей), из‑за чего рыба выглядит массивной.\n" +
                    "Окраска меняется с возрастом: у молодых особей («подлещиков») — серебристая, " +
                    "у взрослых — золотисто‑коричневая на боках, спина темнее, плавники серые, иногда с тёмными краями.\n" +
                    "Размеры: средний лещ — 25–40 см и 1,5–3кг, крупные экземпляры бывают по 5–6кг и более. " +
                    "Максимальная длина — до 80см, живёт до 20–23лет..",
            tipsBaits = "Животные: мотыль (часто лучший вариант, особенно в холодной воде), опарыш, " +
                    "червь (навозный, выползок), иногда пучок мотыля или «бутерброд» мотыль+опарыш.\n" +
                    "Растительные: кукуруза, горох, перловка, тесто, манная болтушка. " +
                    "Летом и в тёплой воде растительные насадки могут работать отлично.\n" +
                    "Комбинированные варианты выручают при капризном клёве.",
            tackles = "Фидер (пикер) — самый популярный вариант. Подходит удилище средней жёсткости, " +
                    "тест под вес кормушки. Кормушка нужна компактная, чтобы не пугать осторожную рыбу. " +
                    "Поводок — 0,12–0,14мм, длина 50–100см (зависит от течения и активности рыбы). " +
                    "Крючки №8–14 (по международной нумерации) с тонким цевьём.\n" +
                    "Донка/закидушка. Работает на стоячих водоёмах и слабом течении. " +
                    "Важно использовать деликатную огрузку и не перегружать оснастку.\n" +
                    "Поплавочная удочка. Эффективна весной и осенью на ближней дистанции, " +
                    "в окнах среди травы или у бровки. Нужна чувствительная оснастка и тонкая леска.\n" +
                    "Болонская снасть. Подходит для ловли в проводку на умеренном течении.",
            baitForFish = "Для леща прикормка критически важна:\n" +
                    "используйте тяжёлые смеси, которые остаются в точке, а не уносятся течением;\n" +
                    "добавляйте грунт или глину для вязкости, особенно на течении;\n" +
                    "обязательно включайте в прикормку часть будущей наживки: мелкого мотыля, опарыша, " +
                    "дроблёную кукурузу или горох;\n" +
                    "ароматизаторы подбирайте по сезону: весной и осенью — нейтральные или пряные (кориандр, чеснок), " +
                    "летом — сладкие (ваниль, карамель, фруктовые ароматы).\n" +
                    "Тактика: закормите точку серией из 5–10 шаров или несколькими забросами кормушек, " +
                    "затем поддерживайте точку небольшими докормами каждые 15–30минут.",
            adviceFromFishermen = "Сезонные особенности:\n" +
                    "Весна. Перед нерестом лещ активно кормится и подходит ближе к мелководью. " +
                    "Нерест начинается при температуре воды 12–15°C (обычно в мае). " +
                    "В этот период рыба шумная, заметны всплески.\n" +
                    "Лето. Держится на глубине, часто на бровках и выходах из ям. Наиболее активен " +
                    "на зорях и в пасмурную погоду. Может образовывать крупные стаи, которые " +
                    "«вспахивают» дно — по всплывающим пузырькам газа можно понять, где кормится стая.\n" +
                    "Осень. С похолоданием лещ уходит ещё глубже, держится плотными стаями и продолжает питаться," +
                    " накапливая жир.\n" +
                    "Зима. Зимует в глубоких ямах, активность сильно снижается, но ловить можно " +
                    "по первому и последнему льду, а также в периоды оттепелей. Выбирайте тихие места. \n" +
                    "Лещ очень осторожен: громкий шум на берегу может надолго отпугнуть стаю.\n" +
                    "Ловите на стабильной точке. Лещ ходит стаями по определённым маршрутам, " +
                    "поэтому важно удерживать рыбу прикормкой.\n" +
                    "Следите за поклёвкой. У леща аккуратная поклёвка: сначала лёгкие подёргивания, " +
                    "потом уверенный уход вершинки или поплавка. Подсекайте после уверенного движения.\n" +
                    "Вываживайте спокойно. Лещ - сильная рыба, и при резких рывках часто сходит. " +
                    "Держите натяжение, не давайте рыбе уйти в коряги."
        ),
        Fish(
            name = "Судак",
            imageUrl = "sudak",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 8,
            temperatureMax = 25,
            pressureMin = 750,
            pressureMax = 780,
            description = "У судака характерный «хищный» облик:\n" +
                    "прогонистое, сжатое с боков тело — заточено под стремительные броски;\n" +
                    "большая голова и очень крупный рот с заметными клыкообразными зубами (у самцов они крупнее);\n" +
                    "два спинных плавника: первый — с жёсткими колючими лучами, второй — с мягкими;\n" +
                    "окраска маскировочная: спина и верх головы зеленовато‑серые или буроватые, брюхо белое, " +
                    "на боках — 8–12 тёмных поперечных полос;\n" +
                    "крупные глаза со светоотражающим слоем — это помогает охотиться при слабом освещении.\n" +
                    "Средние размеры — 50–60см и 2–4кг, но встречаются экземпляры свыше 1м и до 10–15кг. Живёт до 15–17лет.",
            tipsBaits = "Узкотелые виброхвосты и твистеры, поролоновые рыбки, живец (пескарь, уклейка).",
            tackles = "Спиннинг. Самый популярный способ. Удилище 2,4–3,0м, тест 15–40г (для глубин и течения), " +
                    "строй средне‑быстрый. Катушка 3000–4000, плетёнка 0,12–0,18мм.\n" +
                    "Джиг. Основа ловли судака: силиконовые приманки (твистеры, виброхвосты) 7–12см на джиг‑головке " +
                    "или на шарнирном монтаже. Проводка — ступенька по дну, акцент на свалах, бровках, выходах из ям.\n" +
                    "Воблеры. Подойдут минноу 90–130мм с заглублением под рабочую глубину. " +
                    "Эффективны на ночных выходах и в сумерках.\n" +
                    "Живец. Классика для донок и поставушек: уклейка, пескарь, мелкий ерш. Крючок одинарный или двойник, поводок металлический (если есть щука) либо флюорокарбон 0,35–0,45мм.\n" +
                    "Зимняя ловля. Вертикальный джиг (балансиры, раттлины, тяжёлые мормышки с тюлькой/тюлькой‑резкой), ловля на бровках и свалах.",
            baitForFish = "силикон (твистер, виброхвост, слаг) в натуральных и «кислотных» расцветках;\n" +
                    "воблеры минноу с нейтральной или слабоположительной плавучестью;\n" +
                    "балансиры и раттлины 7–9см зимой;\n" +
                    "живец 7–12см, лучше узкотелый.",
            adviceFromFishermen = "Сезонные особенности:\n" +
                    "Весна. Перед и во время нереста (при температуре воды около 12°C) судак держится на " +
                    "мелководьях 1–3м, где есть твёрдые субстраты для кладки икры. " +
                    "Самец очищает площадку и потом охраняет икру.\n" +
                    "Лето. Днём уходит на глубину 4–8м и в укрытия, ночью выходит кормиться ближе к " +
                    "берегу и на более мелкие участки. Часто устраивает «бой» — всплески на поверхности, " +
                    "когда гоняет уклейку и мелкую рыбу.\n" +
                    "Осень. С похолоданием судак концентрируется на глубоких свалах и ямах, активно питается, " +
                    "набирая жир. Это один из лучших периодов для ловли.\n" +
                    "Зима. Держится на ямах и русловых свалах; активность ниже, но стабильный клёв возможен в оттепели и на участках с небольшим течением"
        ),
        Fish(
            name = "Карась",
            imageUrl = "carassius_carassius",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 15,
            temperatureMax = 25,
            pressureMin = 735,
            pressureMax = 755,
            description = "Рыба семейства карповых. Обитает в стоячих водоемах с илистым дном." +
                    "Тело высокое, сжатое с боков, покрыто крупной гладкой чешуёй. " +
                    "Окраска сильно зависит от места обитания: в илистых водоёмах рыба темнее, " +
                    "в более чистых — с золотистым отливом. У золотого карася голова округлая, " +
                    "а у серебряного — слегка заострённая. Спинной плавник длинный, причём его " +
                    "последний неветвистый луч оснащён зазубренным шипом." +
                    "Более неприхотлив к дефициту кислорода, чем серебряный карась.  " +
                    "Размеры: средние особи — 15–35 см при весе 0,5–3 кг, но отдельные " +
                    "экземпляры могут достигать 5 кг",
            tipsBaits = "Животные: навозный, дождевой, земляной червь, мотыль, опарыш. " +
                    "Растительные: распаренные или отварные злаки (овёс, рожь, пшеница, ячмень), " +
                    "распаренный горох, консервированная кукуруза, варёная перловка, мякиш белого хлеба, мучное тесто. " +
                    "Если клёв капризный, попробуйте «бутерброды» — комбинации, " +
                    "например опарыш с кукурузой или мотыль с опарышем",
            tackles = "	Можно взять маховое удилище (удобно для дистанций до 15 м, например 5–7 м) " +
                    "или матчевое (для более дальних забросов, до 30–50 м). " +
                    "Поплавок лучше брать чувствительный, продолговатой формы с тонким кончиком. " +
                    "Иногда удобно скользящее крепление — так проще менять глубину. " +
                    "Леска: основная 0,14–0,18 мм, поводок на 0,02–0,04 мм тоньше основной, " +
                    "чтобы при обрыве потерять только крючок. Цвет лески лучше подбирать под воду: " +
                    "тёмную для мутной, прозрачную для чистой. " +
                    "Грузила распределяйте так, чтобы виднелась только вершинка антенны поплавка. " +
                    "Крючки подбирайте под наживку: №18 для мотыля, №16–14 для опарыша, №12–10 для червя. " +
                    "Жало должно быть прямым, не загнутым внутрь — у карася небольшой рот, и он может заметить цевьё. ",
            baitForFish = "Закормите точку ловли: сделайте несколько небольших шариков и бросьте " +
                    "в радиус примерно 1 метра от места заброса. Дальше, если клёв прекратился, " +
                    "можно подбросить ещё немного. В состав прикормки часто добавляют ароматизаторы: " +
                    "карась хорошо реагирует на запахи чеснока, аниса, конопли, ванили",
            adviceFromFishermen = "При поклёвке не подсекайте слишком рано: карась часто осторожно «пробует» наживку. " +
                    "Если сигнал слабый, подождите 2–3 секунды. \n" +
                    "При вываживании действуйте аккуратно: у карася довольно нежная ротовая полость, и он может сойти. \n" +
                    "Если в одной точке клёв затих, попробуйте сместиться на пару метров или немного изменить глубину. ",
        ),

        Fish(
            name = "Карась серебряный",
            imageUrl = "carassiu_gibelio",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 15,
            temperatureMax = 25,
            pressureMin = 735,
            pressureMax = 755,
            description = "Пресноводная, теплолюбивая рыба, способная жить в прудах и мелких, " +
                    "легко прогревающихся водоемах. При неблагоприятных условиях образует мелкую, " +
                    "низкотелую форму. Серебряный карась больше привязан к большим озерам, " +
                    "встречается и в руслах рек" +
                    " Тело умеренной высоты. Рот без усиков. Спинной плавник длинный, слегка выемчатый," +
                    " первый луч в нем сильно зазубренный. Хвостовой плавник с заметной выемкой. " +
                    "Глоточные зубы однорядные. У молоди зеленовато-коричневая спина и золотисто-бронзовые бока. " +
                    "У взрослых особей бока темно-серебристые, каждая чешуя имеет более или менее выраженную каемку по краю. " +
                    "Интенсивность окраски сильно варьирует в различных водоемах от темной до совершенно светлой с " +
                    "золотистым оттенком. Питается зоопланктоном, донными организмами (преимущественно хирономидами), " +
                    "водорослями и детритом. С декабря по март не питается. Наиболее интенсивно питается в июле – августе " +
                    "Достигает максимальной длины 45 см и массы более 1 кг, обычно не выше 20 см и 350 г. " +
                    "Живет до 14–15 лет, обычно 7–10 лет.",
            tipsBaits = "Животные: навозный, дождевой, земляной червь, мотыль, опарыш. " +
                    "Растительные: распаренные или отварные злаки (овёс, рожь, пшеница, ячмень), " +
                    "распаренный горох, консервированная кукуруза, варёная перловка, мякиш белого хлеба, мучное тесто. " +
                    "Если клёв капризный, попробуйте «бутерброды» — комбинации, " +
                    "например опарыш с кукурузой или мотыль с опарышем",
            tackles = "	Можно взять маховое удилище (удобно для дистанций до 15 м, например 5–7 м) " +
                    "или матчевое (для более дальних забросов, до 30–50 м). " +
                    "Поплавок лучше брать чувствительный, продолговатой формы с тонким кончиком. " +
                    "Иногда удобно скользящее крепление — так проще менять глубину. " +
                    "Леска: основная 0,14–0,18 мм, поводок на 0,02–0,04 мм тоньше основной, " +
                    "чтобы при обрыве потерять только крючок. Цвет лески лучше подбирать под воду: " +
                    "тёмную для мутной, прозрачную для чистой. " +
                    "Грузила распределяйте так, чтобы виднелась только вершинка антенны поплавка. " +
                    "Крючки подбирайте под наживку: №18 для мотыля, №16–14 для опарыша, №12–10 для червя. " +
                    "Жало должно быть прямым, не загнутым внутрь — у карася небольшой рот, и он может заметить цевьё. ",
            baitForFish = "Закормите точку ловли: сделайте несколько небольших шариков и бросьте " +
                    "в радиус примерно 1 метра от места заброса. Дальше, если клёв прекратился, " +
                    "можно подбросить ещё немного. В состав прикормки часто добавляют ароматизаторы: " +
                    "карась хорошо реагирует на запахи чеснока, аниса, конопли, ванили",
            adviceFromFishermen = "При поклёвке не подсекайте слишком рано: карась часто осторожно «пробует» наживку. " +
                    "Если сигнал слабый, подождите 2–3 секунды. \n" +
                    "При вываживании действуйте аккуратно: у карася довольно нежная ротовая полость, и он может сойти. \n" +
                    "Если в одной точке клёв затих, попробуйте сместиться на пару метров или немного изменить глубину. ",
        ),
        Fish(
            name = "Плотва",
            imageUrl = "roach",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 10,
            temperatureMax = 22,
            pressureMin = 745,
            pressureMax = 760,
            description = "Распространенная стайная рыба семейства карповых.\n" +
                    "У плотвы узнаваемый облик:" +
                    "тело вытянутое, сплюснутое с боков;\n" +
                    "чешуя крупная, серебристая, на спине с лёгким синеватым или зеленоватым отливом;\n" +
                    "плавники (особенно грудные, брюшные и анальный) красновато‑оранжевые;\n" +
                    "глаза с оранжевой или красной радужкой;\n" +
                    "рот небольшой, нижняя челюсть чуть выдаётся вперёд.\n" +
                    "Обычные размеры: 5–25см и 100–300г, но в хороших условиях плотва вырастает " +
                    "до 50см и свыше 2кг. Живёт до 15–21года.",
            tipsBaits = "Животные: мотыль (часто лучший вариант, особенно в холодной воде), опарыш, червь, ручейник.\n" +
                    "Растительные: тесто (можно с ароматизаторами), манная болтушка, перловка, кукуруза, хлебный мякиш.\n" +
                    "«Бутерброды»: мотыль+опарыш, опарыш + кукуруза помогают, когда клёв капризный.",
            tackles = "Поплавочная удочка. Классика для берега. Подойдёт маховое удилище 4–7м, " +
                    "тонкая оснастка, поплавок 0,5–2г. Леска 0,12–0,16мм, поводок на 0,02мм тоньше.\n " +
                    "Крючки №14–18 (по международной нумерации) с прямым цевьём.\n" +
                    "Фидер/пикер. Хорош, когда плотва держится на дистанции или на течении. " +
                    "Кормушка небольшого веса, деликатная огрузка, поводок 50–80см.\n" +
                    "Зимняя ловля. Мормышка с мотылём либо безмотылка с активной игрой. Кивок должен быть чувствительным, чтобы замечать осторожные поклёвки. ",
            baitForFish = "Плотву важно удержать в точке ловли. Подойдут:\n" +
                    "готовые смеси для плотвы или универсальные для белой рыбы;\n" +
                    "самодельные: панировочные сухари, молотые семечки, геркулес, немного глины или песка для вязкости;\n" +
                    "обязательно добавьте часть наживки: мелкого мотыля, опарыша, дроблёную кукурузу.\n" +
                    "Ароматизаторы: ваниль, анис, кориандр, фруктовые запахи — летом плотва любит сладкое.",
            adviceFromFishermen = " Закормите точку несколькими небольшими шарами, затем подбрасывайте понемногу каждые 10–20минут.\n" +
                    "Выбирайте деликатную оснастку: плотва осторожна, грубая снасть снижает количество поклёвок.\n" +
                    "Следите за поклёвкой: она часто аккуратная — поплавок чуть дрожит или медленно уходит в сторону. " +
                    "Подсекайте, когда он уверенно ложится или уходит под воду.\n" +
                    "Меняйте глубину и дистанцию: плотва может стоять не у дна, а в 20–50см над ним.",
        ),

        Fish(
            name = "Налим",
            imageUrl = "burbot",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 0,
            temperatureMax = 15,
            pressureMin = 740,
            pressureMax = 755,
            description = "Голова сплюснута, широкая, с непарным усиком на подбородке и короткими усиками у ноздрей. " +
                    "Рот большой, конечный, с многочисленными мелкими щетковидными зубами на челюстях и сошнике. " +
                    "Чешуя мелкая, погружена в кожу. Боковая линия непрерывна до конца анального плавника, далее прерывиста. " +
                    "Общий фон тела оливково-серый, желтый, темно-бурый с большими и мелкими пятнами неправильной формы по бокам тела, на голове и непарных плавниках. " +
                    "Брюхо и нижняя часть головы светло-серого цвета. " +
                    "Длина до 120 см и более, масса до 24 кг. Предельный возраст – 24 года.",
            tipsBaits = "Лучше ловить ночью на живца или кусочки рыбы. Активность возрастает в холодную погоду.",
            tackles = "Жерлица, донка, стукалка (специальная блесна).",
            baitForFish = "В первые годы жизни питается исключительно беспозвоночными, а затем переходит на рыбное питание, поедая и собственную молодь. " +
                    "Иногда взрослые налимы питаются только бентосными организмами(дождевые черви, личинки стрекоз, поденок и ручейников) " +
                    "Поедает икру ценных промысловых рыб (нельмы, чира, сига).",
            adviceFromFishermen = "Лучший клев в самую холодную погоду. Днем прячется под корягами.",
        ),

        Fish(
            name = "Сом",
            imageUrl = "som",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 18,
            temperatureMax = 30,
            pressureMin = 745,
            pressureMax = 760,
            description = "Крупный хищник пресноводных водоемов. Обитает в глубоких ямах рек и водохранилищ.",
            tipsBaits = "Ловят на живца, лягушку или крупного червя. Наиболее активен теплой ночью.",
            tackles = "Мощное карповое или сомовье удилище, мультипликаторная катушка, толстый плетеный шнур.",
            baitForFish = "",
            adviceFromFishermen = "Искать нужно в самых глубоких ямах рек. Мясо жирное, требует осторожности при употреблении.",
        ),

        Fish(
            name = "Красноперка",
            imageUrl = "rudd",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 16,
            temperatureMax = 28,
            pressureMin = 748,
            pressureMax = 762,
            description = "Красивая рыба семейства карповых с яркими плавниками. ",
            tipsBaits = "Предпочитает растительные насадки, хлеб и тесто. ",
            tackles = "Поплавочная удочка",
            baitForFish = "Панировочные сухари, к которым добавляют «пылящие» компоненты (манка, молотая овсянка, сухое молоко) для создания мутного облака в воде",
            adviceFromFishermen = "Любит заросшие участки водоема. Часто держится у поверхности."
        ),

        Fish(
            name = "Линь",
            imageUrl = "liny",
            feedingActivity = FeedingActivity.LOW,
            temperatureMin = 18,
            temperatureMax = 26,
            pressureMin = 745,
            pressureMax = 758,
            description = "Тело толстое, высокое. Рот небольшой, обращен вверх. " +
                    "В углах рта но одному небольшому усику. Глаза маленькие. " +
                    "Чешуя мелкая, глубоко сидящая в коже. " +
                    "Тело покрыто толстым слоем слизи. " +
                    "Плавники мягкие, закругленные, хвостовой – с очень слабой выемкой. " +
                    "У самок брюшные плавники короче грудных, у самцов – длиннее. " +
                    "Хвостовой стебель высокий. Глоточные зубы однорядные. " +
                    "Спина темно-зеленая или зеленовато-коричневая, бока оливково-зеленые с золотистым отливом, " +
                    "брюхо сероватое; плавники темно-коричневые или серые. Длина до 70 см, масса до 8 кг. " +
                    "Продолжительность жизни до 13 лет",
            tipsBaits = "Лучше ловить на червя или опарыша возле камыша. ",
            tackles = "Поплавочная удочка",
            baitForFish = "Панировочные сухари (60%), сухое молоко (15%), молотый бисквит (15%)." +
                    "Немного мелкого мотыля или опарыша. Активатор клева на основе бетаина, " +
                    "ароматизатор корица или ваниль. Можно добавить немного песка как рыхлителя",
            adviceFromFishermen = "Клюет аккуратно и осторожно. При вываживании сопротивляется слабо, но сильно путается в траве",
        ),

        Fish(
            name = "Белый амур",
            imageUrl = "whiteamur",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 20,
            temperatureMax = 30,
            pressureMin = 750,
            pressureMax = 780,
            description = "Пресноводная рыба семейства карповых.\n" +
                    "    Внешний вид: тело вытянутое, массивное, покрыто крупной плотной чешуёй. Спина обычно зеленовато-серая, бока светлые с золотистым оттенком, брюхо белое.\n" +
                    "    Размер: чаще встречается длиной 70–100 см, но крупные особи могут достигать около 1,5 м и веса более 30 кг.",
            tipsBaits = "Молодые побеги водных растений, завязь огурца, тигровый орех, бойлы со вкусом фруктов.",
            tackles = "Мощная поплавочная снасть",
            baitForFish = "Часто используются пеллетс, бойлы, а также технопланктон (для толстолобика). Основу могут составлять каши из злаков, комбикорма. " +
                    "Для белого амура эффективны прикормки с добавлением зелени, огурца, водорослей.",
            adviceFromFishermen = "Любит теплую воду.Очень силен при вываживании. Клюет на специфические насадки растительного происхождения",
        ),

        Fish(
            name = "Толстолобик",
            imageUrl = "tolstolobik",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 20,
            temperatureMax = 30,
            pressureMin = 740,
            pressureMax = 760,
            description = "Глаза посажены низко, их нижний край ниже уровня углов рта. " +
                    "Жаберные тычинки слиты в сплошную ленту. На брюхе от горла до анального отверстия острый киль. " +
                    "Глоточные зубы однорядные, плоские, очень сильные, сжатые; на жевательной поверхности исчерченные." +
                    "Спина и верх головы зеленовато-серые, бока и брюхо серебристые; спинной и хвостовой плавники зеленовато-серые, другие плавники светлые (слегка желтоватые). " +
                    "Наибольшая длина 1 м и масса 16 кг. " +
                    "Предельный возраст свыше 20 лет.",
            tipsBaits = "Технопланктон (основная насадка), ароматизированные пенопластовые шарики.",
            tackles = "Специализированная палка для технопланктона («палка толстолобика») с тремпелем.",
            baitForFish = "Основа всей рыбалки — технопланктон, который при растворении создает облако съедобной взвеси, имитирующей его естественный корм (планктон).",
            adviceFromFishermen = "Наиболее активен в теплую безветренную погоду.Рыба крайне пуглива, ловля требует тишины.",
        ),

        Fish(
            name = "Голавль",
            imageUrl = "chub",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 14,
            temperatureMax = 25,
            pressureMin = 745,
            pressureMax = 760,
            description = "Сильная и красивая рыба семейства карповых.  Держится на течении, любит перекаты и быстрины.",
            tipsBaits = "Майский жук, кузнечик, вишня, поверхностные воблеры-крэнки.",
            tackles = "Нахлыст, поплавок",
            baitForFish = "Основа: Глина с землей (до 50% состава).\n" +
                    "Кормовая часть: Распаренная пшеница, зерна кукурузы, горох.\n" +
                    "Запах: Часто работают пряные ароматы, например, анис или укроп.",
            adviceFromFishermen = "Прикармливать нужно точку ловли небольшими порциями, но регулярно.Очень осторожен, боится тени рыболова.",
        ),
        Fish(
            name = "Жерех",
            imageUrl = "zherekh",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 10,
            temperatureMax = 25,
            pressureMin = 740,
            pressureMax = 760,
            description = "Хищная рыба семейства карповых, известная своей скоростью и мощными атаками на малька у поверхности воды.",
            tipsBaits = "Лучше ловить на воблеры, кастмастеры и блёсны в местах быстрого течения и перекатов.",
            tackles = "Спиннинг",
            baitForFish = "",
            adviceFromFishermen = "Охотится на поверхности воды, создавая характерный «бой».",
        ),

        Fish(
            name = "Чехонь",
            imageUrl = "chekhon",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 14,
            temperatureMax = 24,
            pressureMin = 745,
            pressureMax = 755,
            description = "Стайная рыба с саблевидным телом и верхним ртом. Питается зоопланктоном и насекомыми.",
            tipsBaits = "Эффективна ловля на мушки, опарыша и мелкие блёсны.",
            tackles = "Резинка, фидер, спиннинг с бомбардой.",
            baitForFish = "",
            adviceFromFishermen = "Держится в толще воды, избегая сильного течения.",
        ),

        Fish(
            name = "Сазан",
            imageUrl = "sazan",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 15,
            temperatureMax = 28,
            pressureMin = 740,
            pressureMax = 760,
            description = "Тело толстое, умеренно удлиненное, покрыто крупной плотной чешуей." +
                    "Рот нижний, имеется четыре усика, два из которых более длинные и расположены в углах рта, " +
                    "а короткие – на верхней губе.У сазана спина коричневато-зеленая, бока желто-золотистые, " +
                    "брюхо светлое; грудные, брюшные и анальный плавники темные с легким красноватым оттенком",
            tipsBaits = "Бойлы, кукуруза, горох, картофель, макуха (жмых), черви.",
            tackles = "Фидерное или карповое удилище, катушка с байтраннером, прочные крючки.",
            baitForFish = "Панировочные сухари (50%), молотое овсяное печенье (20%).Пареное пшено (20%), \n" +
                    " консервированная кукуруза (10%).Мелкодисперсная глина (для утяжеления на реке), \n" +
                    " ванильный сахар или ароматизатор анис. Горсть кормового мотыля или резаных червей.",
            adviceFromFishermen = "Требует обильной прикормки. Осторожен и пуглив.",
        ),

        Fish(
            name = "Рыбец",
            imageUrl = "vimba",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 8,
            temperatureMax = 20,
            pressureMin = 740,
            pressureMax = 760,
            description = "Тело умеренно высокое, слегка сжатое с боков. Достигает длины до 60 см " +
                    "и массы около 3 кг, максимальный возраст — 17 лет. \n" +
                    "Характерные признаки:\n" +
                    "На спине между спинным и хвостовым плавником есть хорошо заметный киль, покрытый чешуёй.\n" +
                    "Анальный плавник относительно короткий.\n" +
                    "Рот нижний, полулунной формы, способен сильно выдвигаться вперёд и вниз, что помогает ловить донных беспозвоночных (бентос).\n" +
                    "Спина голубовато-серая, брюхо серебристо-белое, грудные, брюшные и анальный плавники бледно-желтоватые.",
            tipsBaits = "Мотыль, опарыш, мясо моллюска (перловицы/беззубки), личинки насекомых.",
            tackles = "Фидерное или болонское удилище, чувствительный поплавок, тонкая леска.",
            baitForFish = "Как у карпа",
            adviceFromFishermen = "Ловят на глубоких участках рек с умеренным течением. Часто клюет короткими набегами, требуя быстрой реакции."

        ),

        Fish(
            name = "Рак пресноводный",
            imageUrl = "crayfish",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 10,
            temperatureMax = 22,
            pressureMin = 745,
            pressureMax = 760,
            description = "Пресноводное ракообразное, обитающее в чистых водоёмах с укрытиями и твёрдым дном.",
            tipsBaits = "Ловят ночью на раколовки с приманкой из рыбы, мяса или печени.",
            tackles = "Рачница, мережа",
            baitForFish = "",
            adviceFromFishermen = "Прячется в норах под крутыми берегами. Ловится на свежую наживку.",
        ),

        Fish(
            name = "Хариус сибирский",
            imageUrl = "harjus",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 4,
            temperatureMax = 17,
            pressureMin = 755,
            pressureMax = 765,
            description = "Семейство рыб отряда лососёвых. Длина тела обычно 25-35 см, масса около 450 граммов.  Характерным признаком является большой спинной плавник, задняя часть " +
                    "которого у половозрелых самцов в сложенном состоянии достигает жирового, а иногда и основания хвостового плавников",
            tipsBaits = "Для ловли хариуса весом не более 1 кг используют удилище лёгкого класса длиной до 2,1 м. " +
                    "При ловле в озёрах предпочтение следует отдавать более длинному (2,5 м) спиннинговому удилищу. " +
                    "Поскольку у хариуса рот меньше, чем у большинства лососёвых рыб, " +
                    "наиболее уловистыми являются блесны длиной 2—5 см, весом 1—6 г. " +
                    "Наиболее популярными считаются блесны типа «вращающийся лепесток», " +
                    "однако при ловле более крупных рыб вполне пригодны небольшие колеблющиеся блесны. " +
                    "При небольших блеснах и лёгких удилищах для ловли хариуса рекомендуют безынерционные открытые катушки. " +
                    "Леска должна быть диаметром 0,2-0,25 мм",
            tackles = "Предпочтительно на мушку, на поплавочную снасть с наживкой (как правило, червь)",
            baitForFish = "Пищей служат организмы зообентоса: личинки ручейников, веснянок, подёнок, " +
                    "хирономид, их имаго, а в тёплое время года также и разнообразные воздушные насекомые.",
            adviceFromFishermen = "Хариус живёт в реках горного типа с чистой и холодной водой.",
        ),

        Fish(
            name = "Форель",
            imageUrl = "forel",
            feedingActivity = FeedingActivity.HIGH,
            temperatureMin = 9,
            temperatureMax = 16,
            pressureMin = 755,
            pressureMax = 765,
            description = "Форель характеризуется следующими признаками. " +
                    "В одной десятой части тела под боковой линией впереди вертикали, " +
                    "опущенной от начала спинного плавника, находится от 15 до 24 чешуй," +
                    " а над анальным плавником от 13 до 19. Тело форели более или менее сжато с боков; " +
                    "морда короткая и усечённая; на сошнике находятся зубы: " +
                    "на заднем крае передней треугольной пластинки 3—4 зуба и на нёбной поверхности " +
                    "рукоятки сошника 2 ряда сильных зубов. Число лучей в спинном плавнике 3—4 (простые) " +
                    "и 910 (ветвистые), в грудных по 112, в брюшных по 118; в анальном 317—318, в хвостовых 17—19.",
            tipsBaits = "Вращающиеся блёсны, микроколебалки, воблеры, силиконовые приманки (твистеры, виброхвосты)",
            tackles = "Спиннинг\n" +
                    "Это один из самых популярных и универсальных способов. \n" +
                    "Удилище:\n" +
                    "Класс: ультралайт (UL) или лайт (L).\n" +
                    "Тест: для ультралайта — 0,5–5 г, для лайта — 3–12 г (на платниках и для крупной рыбы можно до 14 г).\n" +
                    "Длина: 1,8–2,1 м для горных ручьёв (для манёвренности среди кустов), 2,1–2,4 м для озёр и платников (для дальнего заброса).\n" +
                    "Строй: для рек с течением — быстрый, для стоячей воды и озёр — мягкий.",
            baitForFish = "Креветка, форелевая паста, пеллетс, малёк (верховка), червь, опарыш, мотыль. " +
                    "Из искусственных — вертушки, микроколебалки, воблеры, мушки, стримеры, микроджиг, форелевая резина",
            adviceFromFishermen = "Форель предпочитает чистую, холодную, богатую кислородом воду." +
                    "Избегает прямых солнечных лучей и держится в укрытиях (камни, коряги, перепады глубин)." +
                    "При температуре выше 18 °C уходит на глубину или к родникам и перестаёт питаться ",
        ),
        Fish(
            name = "Осётр сибирский",
            imageUrl = "acipenser_baerii",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 4,
            temperatureMax = 18,
            pressureMin = 740,
            pressureMax = 760,
            description = "Крупная пресноводная рыба с удлинённым веретенообразным телом. Может достигать длины более 2 м и массы свыше 100 кг, хотя размеры сильно зависят от популяции.\n" +
                    "Характерные признаки:\n" +
                    "Вместо обычной чешуи на теле расположены пять продольных рядов костных щитков.\n" +
                    "Рыло удлинённое, рот нижний, выдвижной, с четырьмя усиками перед ним.\n" +
                    "Хвостовой плавник неравнолопастный, верхняя лопасть заметно длиннее нижней.\n" +
                    "Окраска спины варьируется от серовато-коричневой до тёмной, брюхо обычно светлее.\n" +
                    "Питается преимущественно донными беспозвоночными, личинками насекомых и моллюсками.",
            tipsBaits = "В естественном рационе: личинки водных насекомых, черви, моллюски и другие донные беспозвоночные.",
            tackles = "Для наблюдения и изучения используют научные методы исследования и подводную съёмку.",
            baitForFish = "Донные беспозвоночные, моллюски и личинки насекомых.",
            adviceFromFishermen = "Придонная рыба, предпочитающая участки с течением и подходящим грунтом. В Свердловской области перед любыми действиями с этим видом необходимо учитывать действующие запреты и охранный статус."
        ),

        Fish(
            name = "Стерлядь",
            imageUrl = "acipenser_ruthenus",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 4,
            temperatureMax = 20,
            pressureMin = 740,
            pressureMax = 760,
            description = "Небольшой представитель семейства осетровых с удлинённым телом и заострённым рылом. Обычно достигает длины 40–60 см, иногда вырастает крупнее.\n" +
                    "Характерные признаки:\n" +
                    "Тело покрыто пятью рядами костных щитков.\n" +
                    "Рыло длинное и узкое, у некоторых особей слегка загнуто вверх.\n" +
                    "Усики бахромчатые, расположены перед нижним выдвижным ртом.\n" +
                    "Спина сероватая или коричневатая, брюхо светлое.\n" +
                    "Питается личинками насекомых, мелкими донными беспозвоночными и другими организмами, обитающими на грунте.",
            tipsBaits = "Естественная пища: личинки ручейников, подёнок, хирономид и другие донные беспозвоночные.",
            tackles = "Для изучения используют подводную съёмку, наблюдения и научные методы мониторинга.",
            baitForFish = "Донные беспозвоночные и личинки водных насекомых.",
            adviceFromFishermen = "Предпочитает реки с чистой водой и участками подходящего грунта. Перед посещением водоёма необходимо проверить региональные ограничения и охранный статус вида."
        ),

        Fish(
            name = "Нельма",
            imageUrl = "enodus_leucichthys",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 2,
            temperatureMax = 16,
            pressureMin = 740,
            pressureMax = 760,
            description = "Крупная северная рыба семейства лососёвых, относящаяся к роду белорыбиц. Может достигать длины более 1 м и массы в несколько десятков килограммов.\n" +
                    "Характерные признаки:\n" +
                    "Тело удлинённое, серебристое, с относительно мелкой чешуёй.\n" +
                    "Спина тёмная, бока серебристые, брюхо беловатое.\n" +
                    "Рот крупный, конечный, с хорошо развитой нижней челюстью.\n" +
                    "Молодые особи питаются преимущественно беспозвоночными, взрослые могут переходить на рыбную пищу.\n" +
                    "Обитает в северных реках и озёрах бассейнов Северного Ледовитого океана.",
            tipsBaits = "Естественная пища: мелкая рыба, водные беспозвоночные и личинки насекомых.",
            tackles = "Для наблюдения подходят подводная видеосъёмка и научные методы изучения миграций.",
            baitForFish = "Мелкая рыба и водные беспозвоночные составляют естественный рацион в зависимости от возраста.",
            adviceFromFishermen = "Нельма предпочитает прохладную воду и может совершать протяжённые миграции. Перед любыми действиями с видом необходимо проверить его охранный статус и действующие ограничения."
        ),

        Fish(
            name = "Таймень",
            imageUrl = "hucho_taimen",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 2,
            temperatureMax = 16,
            pressureMin = 740,
            pressureMax = 760,
            description = "Крупная пресноводная рыба семейства лососёвых, обитающая в холодных реках и озёрах. Может достигать длины более 1,5 м и массы свыше 50 кг.\n" +
                    "Характерные признаки:\n" +
                    "Тело мощное, удлинённое, с крупной головой и широкой пастью.\n" +
                    "Окраска спины варьируется от буроватой до тёмно-серой, бока светлее.\n" +
                    "На боках часто заметны тёмные пятна, а плавники могут иметь красноватый оттенок.\n" +
                    "Взрослые особи преимущественно питаются рыбой.\n" +
                    "Предпочитает холодные реки с хорошим насыщением воды кислородом и глубокими участками.",
            tipsBaits = "Естественная пища: мелкая и средняя рыба, а также другие водные животные.",
            tackles = "Для изучения применяют научную съёмку, наблюдение и методы мониторинга популяций.",
            baitForFish = "Рыба и другие водные животные составляют основу рациона взрослых особей.",
            adviceFromFishermen = "Таймень растёт медленно и чувствителен к воздействию на популяцию. Перед посещением водоёма следует проверить региональные запреты, охранный статус и правила обращения с пойманной рыбой."
        ),

        Fish(
            name = "Хариус европейский",
            imageUrl = "thymallus_thymallus",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 6,
            temperatureMax = 18,
            pressureMin = 740,
            pressureMax = 760,
            description = "Европейский хариус — пресноводная рыба семейства хариусовых, известная высоким спинным плавником с ярким рисунком. Обычно достигает длины 25–40 см, хотя отдельные особи бывают крупнее.\n" +
                    "Характерные признаки:\n" +
                    "Тело стройное, серебристое, с относительно крупной чешуёй.\n" +
                    "Спинной плавник высокий, особенно у самцов, с рядами пятен и полос.\n" +
                    "На боках могут присутствовать тёмные пятнышки.\n" +
                    "Питается личинками водных насекомых, ракообразными и другими беспозвоночными, иногда мелкой рыбой.\n" +
                    "Предпочитает прохладные, чистые, хорошо насыщенные кислородом реки.",
            tipsBaits = "Естественная пища: личинки ручейников, подёнок, веснянок, хирономид и мелкие водные беспозвоночные.",
            tackles = "Для наблюдения используют подводную съёмку и научные методы мониторинга.",
            baitForFish = "Водные насекомые, личинки и мелкие беспозвоночные.",
            adviceFromFishermen = "Хариус чувствителен к загрязнению воды и изменению речных местообитаний. Перед рыбалкой необходимо проверить точный вид, региональные ограничения и сезонные запреты."
        ),


        Fish(
            name = "Обыкновенный подкаменщик",
            imageUrl = "cottus_gobio",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 4,
            temperatureMax = 16,
            pressureMin = 740,
            pressureMax = 760,
            description = "Небольшая донная рыба семейства керчаковых, обитающая в холодных реках и ручьях с чистой водой. Обычно достигает длины 8–12 см.\n" +
                    "Характерные признаки:\n" +
                    "Тело короткое, широкое в передней части и сужающееся к хвосту.\n" +
                    "Голова крупная и широкая, рот относительно большой.\n" +
                    "Грудные плавники широкие, помогают удерживаться на течении.\n" +
                    "Окраска пятнистая, буровато-серая, хорошо маскирует рыбу среди камней.\n" +
                    "Питается личинками насекомых, мелкими ракообразными и другими донными беспозвоночными.\n" +
                    "Держится у дна, обычно среди камней и гальки.",
            tipsBaits = "Естественная пища: личинки подёнок, ручейников, хирономид и мелкие донные ракообразные.",
            tackles = "Для наблюдения подходят аквариумные исследования, подводная макросъёмка и мониторинг речных местообитаний.",
            baitForFish = "Мелкие донные беспозвоночные.",
            adviceFromFishermen = "Подкаменщик предпочитает холодные, чистые и хорошо насыщенные кислородом водоёмы. Его присутствие может указывать на подходящие условия среды. Перед любыми действиями с видом необходимо проверить его охранный статус."
        ),

        Fish(
            name = "Рипус",
            imageUrl = "ripus",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 4,
            temperatureMax = 16,
            pressureMin = 740,
            pressureMax = 760,
            description = "Рыба рипус характеризуется стройным, продолговатым туловищем. Спина отличается темным зеленоватым или голубым оттенком. Бока у рипуса серебристого оттенка, а брюшко чисто белого цвета. Чешуя на теле держится не крепко поэтому чистить эту рыбу совсем не сложно, а плавники отличаются не ярким коричневым цветом. Рыба способна вырастать в длину до полуметра, при весе порядка 1,5 килограмма.\n" +
                    "\n" +
                    "Отличительная особенность рипуса заключается в том, что он имеет характерный аромат свежих огурцов, если его только что поймать.Рыба рипус отличается жирным и очень вкусным мясом, что и определило промышленный подход в ловле рипуса. ",
            tipsBaits = "Для ловли рипуса рыбаки насаживают весьма разнообразные наживки. Наиболее распространенным считается мотыль, хотя не плохие результаты можно получить, если насадить личинок насекомых, таких как репейной мухи или короеда.\n" +
                    "\n" +
                    "Часть рыболовов отдают предпочтение обычным кусочкам сала. Поэтому, если есть возможность, что лучше на рыбалку взять несколько различных наживок, а в процессе рыбалки станет ясно, какая из них больше понравилась рыбе",
            tackles = "Ловится эта рыба на обычную зимнюю удочку с жестким кончиком. Начинают рыбалку с максимальной глубины, постепенно уменьшая ее. Он может находиться на любой глубине, поэтому рипуса ловят «по вертикали». Для большей результативности не следует ловить на одну мормышку. Как правило, их вяжут на леску несколько, на удалении около 30-ти см одна от другой.\n" +
                    "Лучше использовать жесткую леску, чтобы она не скручивалась, а вот крючок должен быть легким и тонким.\n" +
                    "Желательно всегда ловить на одну лунку. Особенно это касается тех рыбаков, которые решили рыбачить в одной палатке. Если пробурить две лунки рядом, то возможно запутывание лески из-за того, что приходится рыбачить на большой глубине. В результате процесс рыбалки превратится не в интересное занятие, а в бесполезную трату времени",
            baitForFish = "",
            adviceFromFishermen = "На Урале эту рыбу вылавливают в больших объемах и она, в какой-то мере является здесь кормилицей."
        ),

        Fish(
            name = "Сиг",
            imageUrl = "sig",
            feedingActivity = FeedingActivity.MEDIUM,
            temperatureMin = 4,
            temperatureMax = 16,
            pressureMin = 740,
            pressureMax = 760,
            description = "сиг – это хладолюбивая рыба. Тело невысокое, его высота составляет 17–20% длины. " +
                    "Рыло вертикально усечено или слегка скошено кзади. Верхняя челюсть выступает вперед. " +
                    "Окраска серебристая, спина темная; на щеках иногда темные пятна. Длина до 35 см, масса до 500 г.",
            tipsBaits = "Питаются различными насекомыми, ракообразными, моллюсками и личинками. Рыба никогда не пропустит мальков, молодь, корюшку и других мелких рыбешек.\n",
            tackles = "Несмотря на то, что сиг является хищной рыбой, практикуют ловлю на поплавочную удочку. " +
                    "Особенно эффективной она оказывается весной, когда хищник может, не перебирая, клевать любые наживки, включая и червя.\n " +
                    "Считается, что ловля сига спиннингом с применением джиговых приманок и такой же техники лова – интересное занятие. " +
                    "Рыбалка обязательно проходит с использованием мощного удилища, катушки и надежной плетеной лески. " +
                    "В качестве приманки применяют судаковые силиконки или глубоководные воблеры. У сига небольшой рот, следовательно, для него не подойдут массивные и объемные приманки." ,
            baitForFish = "",
            adviceFromFishermen = "Замечено, что сиг охотно ловиться на светлые приманки или те, " +
                    "у которых яркие раскраски. Но лучше всего поэкспериментировать, чтобы понять, на какой цвет приманки рыба больше реагирует.\n"
        )

    )
}